program mult;

var

  da: word = 15;
  db: word = 17;
  dz: word;

begin

  dz := da + db;
  writeln('da + db = ', (dz + 2) * 2);

  writeln('17 * 15 = ', 17 * 15);
  writeln('1 + 1 = ', 1 + 1);
  writeln('1.0 + 1 = ', 1.0 + 1);
  // writeln('0x1 + 1 = ', 0x1 + 1);

  // :7:2 - вывести всего 7 символов, 2 после точки
  writeln('14 / 7 :7:3 = ', 14 / 7 :7:2);
  writeln('2 * (14 / 7) = ', 2 * (14 / 7));


  writeln('1 - 0.3 = ', 1 - 0.3);
  writeln('1.0 - 0.3 = ', 1.0 - 0.3);
  writeln('1 - 0.7 = ', 1 - 0.7);
  writeln('1.0 - 0.7 = ', 1.0 - 0.7);

  writeln('27 / 4 = ', 27 / 4);

  // div - Деление с отбрасыванием остатка. Результат - целочисленная часть.
  writeln('27 div 4 = ', 27 / 4, ' ', 27 div 4);
  writeln('28 div 4 = ', 28 / 4, ' ', 28 div 4);
  writeln('29 div 4 = ', 29 / 4, ' ', 29 div 4);

  // mov - деление с отбрасыванием остатка. Результат - дробная часть.
  writeln('19 mod 4 = ', 19 / 4, ' ', 19 mod 4);
end.
